Νικολακόπουλος Νικόλας
sdi1800133

Για να τρέξετε κάνετε πρώτα : 
   make
και έπειτα τρέχετε:
   ./quic <flags> ./src ./dest

Η main συνάρτηση βρίσκεται στο quic.c αρχείο που διαβάζει τα ορίσματα από τη γραμμή εντολών,
με οποιαδήποτε σειρά εισαχθούν και καλεί την traverse_dir. Έπειτα, αν υπάρχει το flag -d 
θα κληθεί η ρουτίνα διαγραφής. Τέλος, εκτυπώνονται κάποια στατιστικά.

Έχω κάποια global variables για να είναι πιο διακριτή η λειτουργία τους
και για την ευκολότερη διαχείριση τους. Τα flags -v , -d , -l υπάρχουν στο αρχείο 
globalVars.h και αρχικοποιούνται στο fun.c . Επιπρόσθετα, στο fun.c ορίζω και το 
total_bytes που είναι ο αριθμός των bytes που έχουν αντιγραφεί. 

Η traverse_dir δέχεται σαν όρισμα το src path και το dest path και το mode, διότι 
αν δεν υπάρχει το dest path, να το δημιουργήσει με το δοσμένο mode. Αξιοσημείωτο είναι ότι,
αν δεν υπάρχει το dest path, το δημιουργεί και στη συνέχεια ελέγχεται με τη συνάρτηση 
cycle_detect αν δημιουργείται ατέρμονος βρόγχος, ελέγχοντας αν το απόλυτο μονοπάτι src
είναι ίδιο με το απόλυτο μονοπάτι dest(χωρίς το τελευταίο όρισμα του dest, που μόλις
φτιάξαμε). Αν υπάρχει, τότε απλά αφήνουμε ότι έχουμε δημιουργήσει μέχρι εκείνη τη στιγμή
και συνεχίζουμε με τα υπόλοιπα στοιχεία που πρέπει να αντιγράψουμε. 
Στη συνέχεια, διαβάζω ένα ένα τα στοιχεία του src directory και για κάθε ένα ελέγχουμε
αν υπάρχει στο dest directory, σύμφωνα με τα πρότυπα της εκφώνησης(υπάρχουν εκτενή σχόλια 
στον κώδικα).
Η γενική ιδέα είναι ότι αν υπάρχει ένα αντικείμενο του src, ίδιο με το dest, τότε θέτουμε
ένα flag σε false και δεν κάνουμε τίποτα. Όμως, αν δεν είναι ίδιο ή δεν υπάρχει στο dest,
τότε αφήνουμε το flag ως true(είναι αρχικοποιημένο σε true) και to δημιουργούμε στο dest.

Διαχειρίζομαι μόνο τα soft links. Τα hard links τα διαχειρίζομαι και τα αντιγράφω
σαν απλά αρχεία.

Η delete_routine ελέγχει αν ένα αντικείμενο του src υπάρχει στο dest. Αυτό γίνεται με μια
μονή επανάληψη για κάθε στοιχείο <entity> του dest. 
Κοιτάμε αν υπάρχει το αντίστοιχο src/<entity>. 
Αν υπάρχει δεν κάνουμε τίποτα.
Αν δεν υπάρχει το διαγράφουμε.
Αν το <entity> είναι directory, καλούμε την delete_routine αναδρομικά, για να ελέγξουμε 
όλα τα περιεχόμενα του.
